app/Controllers/Admin/OrderController.php

    public function index()
    {


        $customers = $this->db
            ->table('customers')
            ->select('id, name')
            ->get()->getResultArray();
---
SELECT `id`, `name`
FROM `customers`

    public function all()
    {
        $builder = $this->db->table('myorder');
        $builder->select('myorder.*,customers.name as cname');
        $builder->join('customers', 'customers.id = myorder.customer_id', 'inner');
        $data = $builder->get()->getResultArray();
---
SELECT `myorder`.*, `customers`.`name` as `cname`
FROM `myorder`
INNER JOIN `customers` ON `customers`.`id` = `myorder`.`customer_id`

    public function details($id)
    {
        $query = $this->db->table('order_details')
            ->select('order_details.*, products.name as pname, products.price as pprice')
            ->join('products', 'products.id = order_details.product_id', 'inner')
            ->where('order_details.order_id', $id);

        $data = $query->get()->getResultArray();

        $query = $this->db->table('myorder')
            ->select('myorder.*, customers.name as cname')
            ->join('customers', 'customers.id = myorder.customer_id', 'inner')
            ->where('myorder.id', $id);

        $result = $query->get()->getRow();
---
SELECT `order_details`.*, `products`.`name` as `pname`, `products`.`price` as `pprice`
FROM `order_details`
INNER JOIN `products` ON `products`.`id` = `order_details`.`product_id`
WHERE `order_details`.`order_id` = '1'
SELECT `myorder`.*, `customers`.`name` as `cname`
FROM `myorder`
INNER JOIN `customers` ON `customers`.`id` = `myorder`.`customer_id`
WHERE `myorder`.`id` = '1'